Ran Plan for 2 projects:

1. dir: `bruno-athaide-product-test/poc-config-v4` workspace: `default`
1. dir: `bruno-athaide-product-test/shared` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/poc-config-v4` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756218953]
data.configcat_environments.forno_environment: Reading...
data.configcat_environments.staging_environment: Reading...
data.configcat_segments.beta_users_segment: Reading...
data.configcat_environments.prod_environment: Reading...
data.configcat_environments.staging_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756218953]
data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756218953]
data.configcat_environments.forno_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756218953]
data.configcat_segments.beta_users_segment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756218953]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "POC Config V4 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "POC Config V4 - Renamed"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # configcat_setting.my_first_ff will be created
+ resource "configcat_setting" "my_first_ff" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MyFirstFF"
      + name         = "My First Feature Flag"
      + order        = 0
      + setting_type = "boolean"
    }

  # configcat_setting.my_second_ff will be created
+ resource "configcat_setting" "my_second_ff" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MySecondFF"
      + name         = "My Second Feature Flag"
      + order        = 1
      + setting_type = "string"
    }

  # configcat_setting.my_third_ff will be created
+ resource "configcat_setting" "my_third_ff" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MyThirdFF"
      + name         = "My Third Feature Flag"
      + order        = 2
      + setting_type = "string"
    }

  # configcat_setting_value_v2.my_first_ff_value_forno will be created
+ resource "configcat_setting_value_v2" "my_first_ff_value_forno" {
      + environment_id = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.my_first_ff_value_prod will be created
+ resource "configcat_setting_value_v2" "my_first_ff_value_prod" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.my_first_ff_value_staging will be created
+ resource "configcat_setting_value_v2" "my_first_ff_value_staging" {
      + environment_id = "08ddc62c-15af-41a7-8157-8c8e34b9750e"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.my_second_ff_forno will be created
+ resource "configcat_setting_value_v2" "my_second_ff_forno" {
      + environment_id = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + string_value = "test"
        }
    }

  # configcat_setting_value_v2.my_second_ff_prod will be created
+ resource "configcat_setting_value_v2" "my_second_ff_prod" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "custom"
                }
            },
          + {
              + conditions = [
                  + {
                      + segment_condition = {
                          + comparator = "isIn"
                          + segment_id = "08dde199-45b9-4bba-81ca-35544c64b56b"
                        }
                    },
                ]
              + value      = {
                  + string_value = "beta-feature"
                }
            },
        ]
      + value           = {
          + string_value = "test"
        }
    }

  # configcat_setting_value_v2.my_second_ff_staging will be created
+ resource "configcat_setting_value_v2" "my_second_ff_staging" {
      + environment_id = "08ddc62c-15af-41a7-8157-8c8e34b9750e"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + string_value = "test"
        }
    }

  # configcat_setting_value_v2.my_third_ff_forno will be created
+ resource "configcat_setting_value_v2" "my_third_ff_forno" {
      + environment_id = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + string_value = "test"
        }
    }

  # configcat_setting_value_v2.my_third_ff_prod will be created
+ resource "configcat_setting_value_v2" "my_third_ff_prod" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "custom"
                }
            },
          + {
              + conditions = [
                  + {
                      + segment_condition = {
                          + comparator = "isIn"
                          + segment_id = "08dde199-45b9-4bba-81ca-35544c64b56b"
                        }
                    },
                ]
              + value      = {
                  + string_value = "beta-feature"
                }
            },
        ]
      + value           = {
          + string_value = "test"
        }
    }

  # configcat_setting_value_v2.my_third_ff_staging will be created
+ resource "configcat_setting_value_v2" "my_third_ff_staging" {
      + environment_id = "08ddc62c-15af-41a7-8157-8c8e34b9750e"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + string_value = "test"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ config_name = "POC Config V4 - Renamed"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v4
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v4%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v4
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/shared` workspace: `default`
```diff
Changes to Outputs:
+ forno_environment_name   = "Forno"
+ prod_environment_name    = "Production"
+ product_name             = "Bruno Athaide Product Test"
+ staging_environment_name = "Staging"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/shared
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/shared
  ```

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```